Revit 2026 API

# AnalyticalSurfaceBaseSetOuterContour Method

---

Sets the Curve Loop that defines the geometry of the Analytical Surface element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetOuterContour(
	CurveLoop outerContour
)
```
```vb
Public Sub SetOuterContour (
	outerContour As CurveLoop
)
```
```cpp
public:
void SetOuterContour(
	CurveLoop^ outerContour
)
```
```fsharp
member SetOuterContour :
        outerContour : CurveLoop -> unit
```

#### Parameters

outerContour CurveLoop
     New Curve Loop for the Analytical Surface element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Curve Loop must be planar and not self-intersecting.

#### Reference

AnalyticalSurfaceBase Class

Autodesk.Revit.DB.Structure Namespace